Домашняя_работа/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_работа/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)
	ДоступностьЭлементов(Объект.Согласовано);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДоступностьЭлементов(Объект.Согласовано);
КонецПроцедуры

&НаСервере
Процедура ДоступностьЭлементов(Согласовано)
	Если Согласовано Тогда
		Элементы.Дата.Доступность = Ложь;
		Элементы.Номер.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Цены.Доступность = Ложь;
	Иначе
		Элементы.Дата.Доступность = Истина;
		Элементы.Номер.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Ответственный.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.Цены.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
